HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_INTCLRB_Bits.WSI1 */
#define IFX_PSI5_INTCLRB_WSI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_INTCLRB_Bits.WSI2 */
#define IFX_PSI5_INTCLRB_WSI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRB_Bits.WSI2 */
#define IFX_PSI5_INTCLRB_WSI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRB_Bits.WSI2 */
#define IFX_PSI5_INTCLRB_WSI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_INTCLRB_Bits.WSI3 */
#define IFX_PSI5_INTCLRB_WSI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRB_Bits.WSI3 */
#define IFX_PSI5_INTCLRB_WSI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRB_Bits.WSI3 */
#define IFX_PSI5_INTCLRB_WSI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_INTCLRB_Bits.WSI4 */
#define IFX_PSI5_INTCLRB_WSI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRB_Bits.WSI4 */
#define IFX_PSI5_INTCLRB_WSI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRB_Bits.WSI4 */
#define IFX_PSI5_INTCLRB_WSI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_INTCLRB_Bits.WSI5 */
#define IFX_PSI5_INTCLRB_WSI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRB_Bits.WSI5 */
#define IFX_PSI5_INTCLRB_WSI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRB_Bits.WSI5 */
#define IFX_PSI5_INTCLRB_WSI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.CRCI */
#define IFX_PSI5_INTENA_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.CRCI */
#define IFX_PSI5_INTENA_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.CRCI */
#define IFX_PSI5_INTENA_CRCI_OFF (6)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.FWI */
#define IFX_PSI5_INTENA_FWI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.FWI */
#define IFX_PSI5_INTENA_FWI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.FWI */
#define IFX_PSI5_INTENA_FWI_OFF (7)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.MEI */
#define IFX_PSI5_INTENA_MEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.MEI */
#define IFX_PSI5_INTENA_MEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.MEI */
#define IFX_PSI5_INTENA_MEI_OFF (5)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.NBI */
#define IFX_PSI5_INTENA_NBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.NBI */
#define IFX_PSI5_INTENA_NBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.NBI */
#define IFX_PSI5_INTENA_NBI_OFF (4)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.NFI */
#define IFX_PSI5_INTENA_NFI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.NFI */
#define IFX_PSI5_INTENA_NFI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.NFI */
#define IFX_PSI5_INTENA_NFI_OFF (16)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.RBI */
#define IFX_PSI5_INTENA_RBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.RBI */
#define IFX_PSI5_INTENA_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.RBI */
#define IFX_PSI5_INTENA_RBI_OFF (2)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.RDI */
#define IFX_PSI5_INTENA_RDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.RDI */
#define IFX_PSI5_INTENA_RDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.RDI */
#define IFX_PSI5_INTENA_RDI_OFF (1)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.RMI */
#define IFX_PSI5_INTENA_RMI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.RMI */
#define IFX_PSI5_INTENA_RMI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.RMI */
#define IFX_PSI5_INTENA_RMI_OFF (9)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.RSI */
#define IFX_PSI5_INTENA_RSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.RSI */
#define IFX_PSI5_INTENA_RSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.RSI */
#define IFX_PSI5_INTENA_RSI_OFF (0)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.RUI */
#define IFX_PSI5_INTENA_RUI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.RUI */
#define IFX_PSI5_INTENA_RUI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.RUI */
#define IFX_PSI5_INTENA_RUI_OFF (8)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.TEI */
#define IFX_PSI5_INTENA_TEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.TEI */
#define IFX_PSI5_INTENA_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.TEI */
#define IFX_PSI5_INTENA_TEI_OFF (3)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.TOI */
#define IFX_PSI5_INTENA_TOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.TOI */
#define IFX_PSI5_INTENA_TOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.TOI */
#define IFX_PSI5_INTENA_TOI_OFF (14)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.TOOI */
#define IFX_PSI5_INTENA_TOOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.TOOI */
#define IFX_PSI5_INTENA_TOOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.TOOI */
#define IFX_PSI5_INTENA_TOOI_OFF (15)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.TPI */
#define IFX_PSI5_INTENA_TPI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.TPI */
#define IFX_PSI5_INTENA_TPI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.TPI */
#define IFX_PSI5_INTENA_TPI_OFF (10)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.TPOI */
#define IFX_PSI5_INTENA_TPOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.TPOI */
#define IFX_PSI5_INTENA_TPOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.TPOI */
#define IFX_PSI5_INTENA_TPOI_OFF (11)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.TSI */
#define IFX_PSI5_INTENA_TSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.TSI */
#define IFX_PSI5_INTENA_TSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.TSI */
#define IFX_PSI5_INTENA_TSI_OFF (12)

/** \\brief  Length for Ifx_PSI5_INTENA_Bits.TSOI */
#define IFX_PSI5_INTENA_TSOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENA_Bits.TSOI */
#define IFX_PSI5_INTENA_TSOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENA_Bits.TSOI */
#define IFX_PSI5_INTENA_TSOI_OFF (13)

/** \\brief  Length for Ifx_PSI5_INTENB_Bits.SCRI0 */
#define IFX_PSI5_INTENB_SCRI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENB_Bits.SCRI0 */
#define IFX_PSI5_INTENB_SCRI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTENB_Bits.SCRI0 */
#define IFX_PSI5_INTENB_SCRI0_OFF (18)

/** \\brief  Length for Ifx_PSI5_INTENB_Bits.SCRI1 */
#define IFX_PSI5_INTENB_SCRI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTENB_Bits.SCRI1 */
#define IFX_PSI5_INTENB_SCRI1_MSK (0x1)

