HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxPsi5_bf.h
/** \\brief  Mask for Ifx_PSI5_INTOV_Bits.ERRI */
#define IFX_PSI5_INTOV_ERRI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTOV_Bits.ERRI */
#define IFX_PSI5_INTOV_ERRI_OFF (5)

/** \\brief  Length for Ifx_PSI5_INTOV_Bits.FWI */
#define IFX_PSI5_INTOV_FWI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTOV_Bits.FWI */
#define IFX_PSI5_INTOV_FWI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTOV_Bits.FWI */
#define IFX_PSI5_INTOV_FWI_OFF (7)

/** \\brief  Length for Ifx_PSI5_INTOV_Bits.RBI */
#define IFX_PSI5_INTOV_RBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTOV_Bits.RBI */
#define IFX_PSI5_INTOV_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTOV_Bits.RBI */
#define IFX_PSI5_INTOV_RBI_OFF (2)

/** \\brief  Length for Ifx_PSI5_INTOV_Bits.RDI */
#define IFX_PSI5_INTOV_RDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTOV_Bits.RDI */
#define IFX_PSI5_INTOV_RDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTOV_Bits.RDI */
#define IFX_PSI5_INTOV_RDI_OFF (1)

/** \\brief  Length for Ifx_PSI5_INTOV_Bits.RSI */
#define IFX_PSI5_INTOV_RSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTOV_Bits.RSI */
#define IFX_PSI5_INTOV_RSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTOV_Bits.RSI */
#define IFX_PSI5_INTOV_RSI_OFF (0)

/** \\brief  Length for Ifx_PSI5_INTOV_Bits.SDI */
#define IFX_PSI5_INTOV_SDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTOV_Bits.SDI */
#define IFX_PSI5_INTOV_SDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTOV_Bits.SDI */
#define IFX_PSI5_INTOV_SDI_OFF (6)

/** \\brief  Length for Ifx_PSI5_INTOV_Bits.TBI */
#define IFX_PSI5_INTOV_TBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTOV_Bits.TBI */
#define IFX_PSI5_INTOV_TBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTOV_Bits.TBI */
#define IFX_PSI5_INTOV_TBI_OFF (4)

/** \\brief  Length for Ifx_PSI5_INTOV_Bits.TDI */
#define IFX_PSI5_INTOV_TDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTOV_Bits.TDI */
#define IFX_PSI5_INTOV_TDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTOV_Bits.TDI */
#define IFX_PSI5_INTOV_TDI_OFF (3)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.CRCI */
#define IFX_PSI5_INTSETA_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.CRCI */
#define IFX_PSI5_INTSETA_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.CRCI */
#define IFX_PSI5_INTSETA_CRCI_OFF (6)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.FWI */
#define IFX_PSI5_INTSETA_FWI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.FWI */
#define IFX_PSI5_INTSETA_FWI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.FWI */
#define IFX_PSI5_INTSETA_FWI_OFF (7)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.MEI */
#define IFX_PSI5_INTSETA_MEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.MEI */
#define IFX_PSI5_INTSETA_MEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.MEI */
#define IFX_PSI5_INTSETA_MEI_OFF (5)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.NBI */
#define IFX_PSI5_INTSETA_NBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.NBI */
#define IFX_PSI5_INTSETA_NBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.NBI */
#define IFX_PSI5_INTSETA_NBI_OFF (4)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.NFI */
#define IFX_PSI5_INTSETA_NFI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.NFI */
#define IFX_PSI5_INTSETA_NFI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.NFI */
#define IFX_PSI5_INTSETA_NFI_OFF (16)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.RBI */
#define IFX_PSI5_INTSETA_RBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.RBI */
#define IFX_PSI5_INTSETA_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.RBI */
#define IFX_PSI5_INTSETA_RBI_OFF (2)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.RDI */
#define IFX_PSI5_INTSETA_RDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.RDI */
#define IFX_PSI5_INTSETA_RDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.RDI */
#define IFX_PSI5_INTSETA_RDI_OFF (1)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.RMI */
#define IFX_PSI5_INTSETA_RMI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.RMI */
#define IFX_PSI5_INTSETA_RMI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.RMI */
#define IFX_PSI5_INTSETA_RMI_OFF (9)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.RSI */
#define IFX_PSI5_INTSETA_RSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.RSI */
#define IFX_PSI5_INTSETA_RSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.RSI */
#define IFX_PSI5_INTSETA_RSI_OFF (0)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.RUI */
#define IFX_PSI5_INTSETA_RUI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.RUI */
#define IFX_PSI5_INTSETA_RUI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.RUI */
#define IFX_PSI5_INTSETA_RUI_OFF (8)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.TEI */
#define IFX_PSI5_INTSETA_TEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.TEI */
#define IFX_PSI5_INTSETA_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.TEI */
#define IFX_PSI5_INTSETA_TEI_OFF (3)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.TOI */
#define IFX_PSI5_INTSETA_TOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.TOI */
#define IFX_PSI5_INTSETA_TOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.TOI */
#define IFX_PSI5_INTSETA_TOI_OFF (14)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.TOOI */
#define IFX_PSI5_INTSETA_TOOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.TOOI */
#define IFX_PSI5_INTSETA_TOOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.TOOI */
#define IFX_PSI5_INTSETA_TOOI_OFF (15)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.TPI */
#define IFX_PSI5_INTSETA_TPI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.TPI */
#define IFX_PSI5_INTSETA_TPI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.TPI */
#define IFX_PSI5_INTSETA_TPI_OFF (10)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.TPOI */
#define IFX_PSI5_INTSETA_TPOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.TPOI */
#define IFX_PSI5_INTSETA_TPOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.TPOI */
#define IFX_PSI5_INTSETA_TPOI_OFF (11)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.TSI */
#define IFX_PSI5_INTSETA_TSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.TSI */
#define IFX_PSI5_INTSETA_TSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.TSI */
#define IFX_PSI5_INTSETA_TSI_OFF (12)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.TSOI */
#define IFX_PSI5_INTSETA_TSOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.TSOI */
#define IFX_PSI5_INTSETA_TSOI_MSK (0x1)

