HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI19 */
#define IFX_PSI5_RMISET_RMI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI1 */
#define IFX_PSI5_RMISET_RMI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI1 */
#define IFX_PSI5_RMISET_RMI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI1 */
#define IFX_PSI5_RMISET_RMI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI20 */
#define IFX_PSI5_RMISET_RMI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI20 */
#define IFX_PSI5_RMISET_RMI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI20 */
#define IFX_PSI5_RMISET_RMI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI21 */
#define IFX_PSI5_RMISET_RMI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI21 */
#define IFX_PSI5_RMISET_RMI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI21 */
#define IFX_PSI5_RMISET_RMI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI22 */
#define IFX_PSI5_RMISET_RMI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI22 */
#define IFX_PSI5_RMISET_RMI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI22 */
#define IFX_PSI5_RMISET_RMI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI23 */
#define IFX_PSI5_RMISET_RMI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI23 */
#define IFX_PSI5_RMISET_RMI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI23 */
#define IFX_PSI5_RMISET_RMI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI24 */
#define IFX_PSI5_RMISET_RMI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI24 */
#define IFX_PSI5_RMISET_RMI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI24 */
#define IFX_PSI5_RMISET_RMI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI25 */
#define IFX_PSI5_RMISET_RMI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI25 */
#define IFX_PSI5_RMISET_RMI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI25 */
#define IFX_PSI5_RMISET_RMI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI26 */
#define IFX_PSI5_RMISET_RMI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI26 */
#define IFX_PSI5_RMISET_RMI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI26 */
#define IFX_PSI5_RMISET_RMI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI27 */
#define IFX_PSI5_RMISET_RMI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI27 */
#define IFX_PSI5_RMISET_RMI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI27 */
#define IFX_PSI5_RMISET_RMI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI28 */
#define IFX_PSI5_RMISET_RMI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI28 */
#define IFX_PSI5_RMISET_RMI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI28 */
#define IFX_PSI5_RMISET_RMI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI29 */
#define IFX_PSI5_RMISET_RMI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI29 */
#define IFX_PSI5_RMISET_RMI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI29 */
#define IFX_PSI5_RMISET_RMI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI2 */
#define IFX_PSI5_RMISET_RMI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI2 */
#define IFX_PSI5_RMISET_RMI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI2 */
#define IFX_PSI5_RMISET_RMI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI30 */
#define IFX_PSI5_RMISET_RMI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI30 */
#define IFX_PSI5_RMISET_RMI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI30 */
#define IFX_PSI5_RMISET_RMI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI31 */
#define IFX_PSI5_RMISET_RMI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI31 */
#define IFX_PSI5_RMISET_RMI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI31 */
#define IFX_PSI5_RMISET_RMI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI3 */
#define IFX_PSI5_RMISET_RMI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI3 */
#define IFX_PSI5_RMISET_RMI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI3 */
#define IFX_PSI5_RMISET_RMI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI4 */
#define IFX_PSI5_RMISET_RMI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI4 */
#define IFX_PSI5_RMISET_RMI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI4 */
#define IFX_PSI5_RMISET_RMI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI5 */
#define IFX_PSI5_RMISET_RMI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI5 */
#define IFX_PSI5_RMISET_RMI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI5 */
#define IFX_PSI5_RMISET_RMI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI6 */
#define IFX_PSI5_RMISET_RMI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI6 */
#define IFX_PSI5_RMISET_RMI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI6 */
#define IFX_PSI5_RMISET_RMI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI7 */
#define IFX_PSI5_RMISET_RMI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI7 */
#define IFX_PSI5_RMISET_RMI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI7 */
#define IFX_PSI5_RMISET_RMI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI8 */
#define IFX_PSI5_RMISET_RMI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI8 */
#define IFX_PSI5_RMISET_RMI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI8 */
#define IFX_PSI5_RMISET_RMI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI9 */
#define IFX_PSI5_RMISET_RMI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI9 */
#define IFX_PSI5_RMISET_RMI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI9 */
#define IFX_PSI5_RMISET_RMI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI0 */
#define IFX_PSI5_RSICLR_RSI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI0 */
#define IFX_PSI5_RSICLR_RSI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI0 */
#define IFX_PSI5_RSICLR_RSI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI10 */
#define IFX_PSI5_RSICLR_RSI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI10 */
#define IFX_PSI5_RSICLR_RSI10_MSK (0x1)

