HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_RSISET_Bits.RSI5 */
#define IFX_PSI5_RSISET_RSI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSISET_Bits.RSI5 */
#define IFX_PSI5_RSISET_RSI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSISET_Bits.RSI5 */
#define IFX_PSI5_RSISET_RSI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_RSISET_Bits.RSI6 */
#define IFX_PSI5_RSISET_RSI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSISET_Bits.RSI6 */
#define IFX_PSI5_RSISET_RSI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSISET_Bits.RSI6 */
#define IFX_PSI5_RSISET_RSI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_RSISET_Bits.RSI7 */
#define IFX_PSI5_RSISET_RSI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSISET_Bits.RSI7 */
#define IFX_PSI5_RSISET_RSI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSISET_Bits.RSI7 */
#define IFX_PSI5_RSISET_RSI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_RSISET_Bits.RSI8 */
#define IFX_PSI5_RSISET_RSI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSISET_Bits.RSI8 */
#define IFX_PSI5_RSISET_RSI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSISET_Bits.RSI8 */
#define IFX_PSI5_RSISET_RSI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_RSISET_Bits.RSI9 */
#define IFX_PSI5_RSISET_RSI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSISET_Bits.RSI9 */
#define IFX_PSI5_RSISET_RSI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSISET_Bits.RSI9 */
#define IFX_PSI5_RSISET_RSI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI0 */
#define IFX_PSI5_TEICLR_TEI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI0 */
#define IFX_PSI5_TEICLR_TEI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI0 */
#define IFX_PSI5_TEICLR_TEI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI10 */
#define IFX_PSI5_TEICLR_TEI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI10 */
#define IFX_PSI5_TEICLR_TEI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI10 */
#define IFX_PSI5_TEICLR_TEI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI11 */
#define IFX_PSI5_TEICLR_TEI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI11 */
#define IFX_PSI5_TEICLR_TEI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI11 */
#define IFX_PSI5_TEICLR_TEI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI12 */
#define IFX_PSI5_TEICLR_TEI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI12 */
#define IFX_PSI5_TEICLR_TEI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI12 */
#define IFX_PSI5_TEICLR_TEI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI13 */
#define IFX_PSI5_TEICLR_TEI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI13 */
#define IFX_PSI5_TEICLR_TEI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI13 */
#define IFX_PSI5_TEICLR_TEI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI14 */
#define IFX_PSI5_TEICLR_TEI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI14 */
#define IFX_PSI5_TEICLR_TEI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI14 */
#define IFX_PSI5_TEICLR_TEI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI15 */
#define IFX_PSI5_TEICLR_TEI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI15 */
#define IFX_PSI5_TEICLR_TEI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI15 */
#define IFX_PSI5_TEICLR_TEI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI16 */
#define IFX_PSI5_TEICLR_TEI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI16 */
#define IFX_PSI5_TEICLR_TEI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI16 */
#define IFX_PSI5_TEICLR_TEI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI17 */
#define IFX_PSI5_TEICLR_TEI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI17 */
#define IFX_PSI5_TEICLR_TEI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI17 */
#define IFX_PSI5_TEICLR_TEI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI18 */
#define IFX_PSI5_TEICLR_TEI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI18 */
#define IFX_PSI5_TEICLR_TEI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI18 */
#define IFX_PSI5_TEICLR_TEI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI19 */
#define IFX_PSI5_TEICLR_TEI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI19 */
#define IFX_PSI5_TEICLR_TEI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI19 */
#define IFX_PSI5_TEICLR_TEI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI1 */
#define IFX_PSI5_TEICLR_TEI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI1 */
#define IFX_PSI5_TEICLR_TEI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI1 */
#define IFX_PSI5_TEICLR_TEI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI20 */
#define IFX_PSI5_TEICLR_TEI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI20 */
#define IFX_PSI5_TEICLR_TEI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI20 */
#define IFX_PSI5_TEICLR_TEI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI21 */
#define IFX_PSI5_TEICLR_TEI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI21 */
#define IFX_PSI5_TEICLR_TEI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI21 */
#define IFX_PSI5_TEICLR_TEI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI22 */
#define IFX_PSI5_TEICLR_TEI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI22 */
#define IFX_PSI5_TEICLR_TEI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI22 */
#define IFX_PSI5_TEICLR_TEI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI23 */
#define IFX_PSI5_TEICLR_TEI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI23 */
#define IFX_PSI5_TEICLR_TEI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI23 */
#define IFX_PSI5_TEICLR_TEI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI24 */
#define IFX_PSI5_TEICLR_TEI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI24 */
#define IFX_PSI5_TEICLR_TEI24_MSK (0x1)

