HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI24 */
#define IFX_PSI5_TEICLR_TEI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI25 */
#define IFX_PSI5_TEICLR_TEI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI25 */
#define IFX_PSI5_TEICLR_TEI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI25 */
#define IFX_PSI5_TEICLR_TEI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI26 */
#define IFX_PSI5_TEICLR_TEI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI26 */
#define IFX_PSI5_TEICLR_TEI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI26 */
#define IFX_PSI5_TEICLR_TEI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI27 */
#define IFX_PSI5_TEICLR_TEI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI27 */
#define IFX_PSI5_TEICLR_TEI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI27 */
#define IFX_PSI5_TEICLR_TEI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI28 */
#define IFX_PSI5_TEICLR_TEI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI28 */
#define IFX_PSI5_TEICLR_TEI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI28 */
#define IFX_PSI5_TEICLR_TEI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI29 */
#define IFX_PSI5_TEICLR_TEI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI29 */
#define IFX_PSI5_TEICLR_TEI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI29 */
#define IFX_PSI5_TEICLR_TEI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI2 */
#define IFX_PSI5_TEICLR_TEI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI2 */
#define IFX_PSI5_TEICLR_TEI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI2 */
#define IFX_PSI5_TEICLR_TEI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI30 */
#define IFX_PSI5_TEICLR_TEI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI30 */
#define IFX_PSI5_TEICLR_TEI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI30 */
#define IFX_PSI5_TEICLR_TEI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI31 */
#define IFX_PSI5_TEICLR_TEI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI31 */
#define IFX_PSI5_TEICLR_TEI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI31 */
#define IFX_PSI5_TEICLR_TEI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI3 */
#define IFX_PSI5_TEICLR_TEI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI3 */
#define IFX_PSI5_TEICLR_TEI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI3 */
#define IFX_PSI5_TEICLR_TEI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI4 */
#define IFX_PSI5_TEICLR_TEI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI4 */
#define IFX_PSI5_TEICLR_TEI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI4 */
#define IFX_PSI5_TEICLR_TEI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI5 */
#define IFX_PSI5_TEICLR_TEI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI5 */
#define IFX_PSI5_TEICLR_TEI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI5 */
#define IFX_PSI5_TEICLR_TEI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI6 */
#define IFX_PSI5_TEICLR_TEI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI6 */
#define IFX_PSI5_TEICLR_TEI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI6 */
#define IFX_PSI5_TEICLR_TEI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI7 */
#define IFX_PSI5_TEICLR_TEI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI7 */
#define IFX_PSI5_TEICLR_TEI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI7 */
#define IFX_PSI5_TEICLR_TEI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI8 */
#define IFX_PSI5_TEICLR_TEI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI8 */
#define IFX_PSI5_TEICLR_TEI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI8 */
#define IFX_PSI5_TEICLR_TEI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_TEICLR_Bits.TEI9 */
#define IFX_PSI5_TEICLR_TEI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI9 */
#define IFX_PSI5_TEICLR_TEI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI9 */
#define IFX_PSI5_TEICLR_TEI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI0 */
#define IFX_PSI5_TEIOV_TEI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI0 */
#define IFX_PSI5_TEIOV_TEI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI0 */
#define IFX_PSI5_TEIOV_TEI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI10 */
#define IFX_PSI5_TEIOV_TEI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI10 */
#define IFX_PSI5_TEIOV_TEI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI10 */
#define IFX_PSI5_TEIOV_TEI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI11 */
#define IFX_PSI5_TEIOV_TEI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI11 */
#define IFX_PSI5_TEIOV_TEI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI11 */
#define IFX_PSI5_TEIOV_TEI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI12 */
#define IFX_PSI5_TEIOV_TEI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI12 */
#define IFX_PSI5_TEIOV_TEI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI12 */
#define IFX_PSI5_TEIOV_TEI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI13 */
#define IFX_PSI5_TEIOV_TEI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI13 */
#define IFX_PSI5_TEIOV_TEI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI13 */
#define IFX_PSI5_TEIOV_TEI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI14 */
#define IFX_PSI5_TEIOV_TEI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI14 */
#define IFX_PSI5_TEIOV_TEI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI14 */
#define IFX_PSI5_TEIOV_TEI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI15 */
#define IFX_PSI5_TEIOV_TEI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI15 */
#define IFX_PSI5_TEIOV_TEI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI15 */
#define IFX_PSI5_TEIOV_TEI15_OFF (15)

