HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxPsi5_bf.h
/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI9 */
#define IFX_PSI5_TEIOV_TEI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI9 */
#define IFX_PSI5_TEIOV_TEI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI0 */
#define IFX_PSI5_TEISET_TEI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI0 */
#define IFX_PSI5_TEISET_TEI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI0 */
#define IFX_PSI5_TEISET_TEI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI10 */
#define IFX_PSI5_TEISET_TEI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI10 */
#define IFX_PSI5_TEISET_TEI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI10 */
#define IFX_PSI5_TEISET_TEI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI11 */
#define IFX_PSI5_TEISET_TEI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI11 */
#define IFX_PSI5_TEISET_TEI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI11 */
#define IFX_PSI5_TEISET_TEI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI12 */
#define IFX_PSI5_TEISET_TEI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI12 */
#define IFX_PSI5_TEISET_TEI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI12 */
#define IFX_PSI5_TEISET_TEI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI13 */
#define IFX_PSI5_TEISET_TEI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI13 */
#define IFX_PSI5_TEISET_TEI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI13 */
#define IFX_PSI5_TEISET_TEI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI14 */
#define IFX_PSI5_TEISET_TEI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI14 */
#define IFX_PSI5_TEISET_TEI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI14 */
#define IFX_PSI5_TEISET_TEI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI15 */
#define IFX_PSI5_TEISET_TEI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI15 */
#define IFX_PSI5_TEISET_TEI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI15 */
#define IFX_PSI5_TEISET_TEI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI16 */
#define IFX_PSI5_TEISET_TEI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI16 */
#define IFX_PSI5_TEISET_TEI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI16 */
#define IFX_PSI5_TEISET_TEI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI17 */
#define IFX_PSI5_TEISET_TEI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI17 */
#define IFX_PSI5_TEISET_TEI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI17 */
#define IFX_PSI5_TEISET_TEI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI18 */
#define IFX_PSI5_TEISET_TEI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI18 */
#define IFX_PSI5_TEISET_TEI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI18 */
#define IFX_PSI5_TEISET_TEI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI19 */
#define IFX_PSI5_TEISET_TEI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI19 */
#define IFX_PSI5_TEISET_TEI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI19 */
#define IFX_PSI5_TEISET_TEI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI1 */
#define IFX_PSI5_TEISET_TEI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI1 */
#define IFX_PSI5_TEISET_TEI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI1 */
#define IFX_PSI5_TEISET_TEI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI20 */
#define IFX_PSI5_TEISET_TEI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI20 */
#define IFX_PSI5_TEISET_TEI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI20 */
#define IFX_PSI5_TEISET_TEI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI21 */
#define IFX_PSI5_TEISET_TEI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI21 */
#define IFX_PSI5_TEISET_TEI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI21 */
#define IFX_PSI5_TEISET_TEI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI22 */
#define IFX_PSI5_TEISET_TEI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI22 */
#define IFX_PSI5_TEISET_TEI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI22 */
#define IFX_PSI5_TEISET_TEI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI23 */
#define IFX_PSI5_TEISET_TEI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI23 */
#define IFX_PSI5_TEISET_TEI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI23 */
#define IFX_PSI5_TEISET_TEI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI24 */
#define IFX_PSI5_TEISET_TEI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI24 */
#define IFX_PSI5_TEISET_TEI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI24 */
#define IFX_PSI5_TEISET_TEI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI25 */
#define IFX_PSI5_TEISET_TEI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI25 */
#define IFX_PSI5_TEISET_TEI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI25 */
#define IFX_PSI5_TEISET_TEI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI26 */
#define IFX_PSI5_TEISET_TEI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI26 */
#define IFX_PSI5_TEISET_TEI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI26 */
#define IFX_PSI5_TEISET_TEI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI27 */
#define IFX_PSI5_TEISET_TEI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI27 */
#define IFX_PSI5_TEISET_TEI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI27 */
#define IFX_PSI5_TEISET_TEI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI28 */
#define IFX_PSI5_TEISET_TEI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI28 */
#define IFX_PSI5_TEISET_TEI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI28 */
#define IFX_PSI5_TEISET_TEI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI29 */
#define IFX_PSI5_TEISET_TEI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI29 */
#define IFX_PSI5_TEISET_TEI29_MSK (0x1)

